БухЭксп/InformationRegisters/CW_НумерацияЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_НумерацияЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПрефиксЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_НумерацияЗаказов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьПоследнийНомерЗаказа(Префикс) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_НумерацияЗаказов.ПрефиксЗаказа КАК ПрефиксЗаказа,
	               |	CW_НумерацияЗаказов.Номер КАК Номер
	               |ИЗ
	               |	РегистрСведений.CW_НумерацияЗаказов КАК CW_НумерацияЗаказов
	               |ГДЕ
	               |	CW_НумерацияЗаказов.ПрефиксЗаказа = &Префикс";
	
	Запрос.УстановитьПараметр("Префикс", СокрЛП(Префикс));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		 Возврат Выборка.Номер;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Процедура ЗаписатьПоследнийНомерЗаказа(Префикс,НомерЗаказа) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запись = РегистрыСведений.CW_НумерацияЗаказов.СоздатьМенеджерЗаписи();
	Запись.ПрефиксЗаказа 	= СокрЛП(Префикс);
	Запись.Номер			=  НомерЗаказа;
	
	Запись.Записать(Истина);
	
КонецПроцедуры
#КонецЕсли
